rokmarko/EspP4/sdkconfig.defaults
# =============================================================================
#  Waveshare ESP32-P4-WIFI6-Touch-LCD-4C  ·  LVGL 9 + ThorVG
# =============================================================================

# --- Target / silicon ---------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"
# The silicon on this board reports revision v1.3. From IDF 5.5.5 the P4 support
# splits in two -- "rev <3.0" and "rev >=3.0" are mutually exclusive, because the
# hardware differs too much to share one image -- and the default is the >=3.0
# half, minimum v3.1. Building that and flashing it fails at esptool:
#
#   bootloader.bin requires chip revision in range [v3.1 - v3.99]
#   (this chip is revision v1.3)
#
# So take the <3.0 half explicitly and ask for the lowest minimum in it, which
# boots on any 0.x or 1.x part. Do not copy Waveshare's rev 3.x pins.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
# 200 MHz PSRAM is gated behind the experimental-features flag; 250 MHz needs
# rev 3.x silicon and is not reachable from this half.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- Flash / partitions -------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# The table goes at 0x10000, not IDF's default 0x8000: the second-stage
# bootloader loads at 0x2000, and IDF v5.5.5 builds a 0x6120-byte bootloader
# for the P4 -- 288 bytes past what the default offset leaves it. This gives it
# 0xE000. partitions.csv carries the matching offsets and the erase-once note.
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# --- NVS ----------------------------------------------------------------------
# Put NVS's page cache and key hash list in PSRAM. Those are the allocations
# that scale with the settings partition's size, and internal RAM is the
# tightest resource here. heap_caps_malloc_prefer() falls back to internal RAM
# if PSRAM is full, so this cannot fail closed. It costs NVS speed -- the CPU
# reaches the cache over SPI -- which is free for us: NVS is touched once at
# boot and again only when an option changes.
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y

# --- PSRAM --------------------------------------------------------------------
# The 720x720 frame buffers and the ARGB8888 vector canvas all live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# --- System -------------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# The only host link on this board is USB-Serial/JTAG (/dev/ttyACM0). As a
# *secondary* console it is output-only, so the debug console could not be
# driven from the host. Making it primary gives both directions.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# ThorVG spawns its own std::thread workers (one per LVGL SW draw unit) and
# rasterises on them. rleRender() alone puts a fixed 16 kB Cell buffer on the
# stack (RENDER_POOL_SIZE in tvgSwRle.cpp) plus RleWorker and Band[40], so
# anything at or below 16 kB faults. 32 kB leaves real headroom.
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=32768

# --- Board support package ----------------------------------------------------
# 4C = 4 inch, 720x720. Set CONFIG_BSP_LCD_TYPE_800_800_3_4_INCH instead for the 3.4C.
CONFIG_BSP_LCD_TYPE_720_720_4_INCH=y

# --- LVGL core ----------------------------------------------------------------
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
# One draw unit, not two. A second one is a ThorVG std::thread worker, and each
# worker holds CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT -- 32 kB of internal RAM,
# for the 16 kB Cell buffer rleRender() puts on the stack. Internal RAM is what
# this board runs out of first, and APS_B's 2 kB-page buffer is 8 kB of .bss on
# top of that. Dropping the pool is the trade CLAUDE.md already names.
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
# Recommended by LVGL whenever ThorVG or FreeType renders on the draw threads.
CONFIG_LV_DRAW_THREAD_STACK_SIZE=32768
CONFIG_LV_USE_PERF_MONITOR=y
# lv_snapshot_take(), used by the serial console's screenshot command.
CONFIG_LV_USE_SNAPSHOT=y
# lvgl_cpp's PropertySetters mixin uses lv_property_t / lv_obj_set_property
# unconditionally on LVGL 9.5+, and those only exist with this option on.
CONFIG_LV_USE_OBJ_PROPERTY=y
# LVGL 9.5.0 has a compile bug in the !LV_USE_OBJ_PROPERTY_NAME branch of
# lv_obj_class_property_get_id() (LV_UNUSED(obj) where obj does not exist).
# Turning names on takes the other branch. Costs a const name table per widget class.
CONFIG_LV_USE_OBJ_PROPERTY_NAME=y
CONFIG_LV_USE_SYSMON=y

# --- Vector graphics: LVGL's bundled ThorVG ----------------------------------
CONFIG_LV_USE_MATRIX=y
CONFIG_LV_USE_VECTOR_GRAPHIC=y
CONFIG_LV_USE_THORVG=y
CONFIG_LV_USE_THORVG_INTERNAL=y
# Lottie needs ThorVG's SVG/JSON loaders. Off by default to keep the binary small;
# flip to =y (plus CONFIG_LV_USE_LOTTIE) to play .json animations.
CONFIG_LV_USE_LOTTIE=n

# --- Fonts used by the demo ---------------------------------------------------
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
